posts/vimgolf-one-number-per-line/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>vimgolf: One number per line | Frankie Liu Pages</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://www.frankliu.org/posts/vimgolf-one-number-per-line/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Frankie Liu">
<link rel="next" href="../git-head-and-branches/" title="git head and branches" type="text/html">
<meta property="og:site_name" content="Frankie Liu Pages">
<meta property="og:title" content="vimgolf: One number per line">
<meta property="og:url" content="http://www.frankliu.org/posts/vimgolf-one-number-per-line/">
<meta property="og:description" content="Solutions common patterns


Link


vimgolf put 56fb2e75ccffcc0009026473





Start file


- One number per line -
-----------------------
2,3,5,7,
11,13,17,
19,23,29,





End file


2
3
5
7
11
13
17
">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-01-18T11:02:17-08:00">
<meta property="article:tag" content="vim">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://www.frankliu.org/">

                <span id="blog-title">Frankie Liu Pages</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">vimgolf: One number per line</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Frankie Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-01-18T11:02:17-08:00" itemprop="datePublished" title="2018-01-18 11:02">2018-01-18 11:02</time></a></p>
                <p class="commentline">
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/vimgolf-one-number-per-line.html">Comments</a>


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Solutions common patterns</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Link</h3>
<div class="outline-text-3" id="text-1-1">
<p>
vimgolf put 56fb2e75ccffcc0009026473
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Start file</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
- One number per line -
-----------------------
2,3,5,7,
11,13,17,
19,23,29,
</pre>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">End file</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
2
3
5
7
11
13
17
19
23
29
</pre>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Deleting the first two lines</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>dj : d{motion} delete, j moves down one line
</li>
<li>2D : D delete the character under the cursor until the end of line
and [count]-1 more lines
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Joining the lines</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>JxJx : Join and delete the extra character twice
</li>
<li>3J   : Joins three lines together
</li>
<li>JJ   : Joins two lines together
</li>
<li>3gJ  : Same as 2, but doesn't remove indent or spaces
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Replacement</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>:s/,/\r/g              : sed like replacement
</li>
<li>:s/,/&lt;C-V&gt;&lt;CR&gt;/g&lt;CR&gt;   : same as above but inserts a control character
</li>
<li>0qqwr&lt;CR&gt;q9@q          : goes to first char in line
record typed characters into register 'q'
wr: macro does a word movement and a char replacement
9@q : execute the contents of 'q' 9 times
</li>
<li>Iwr&lt;CR&gt;&lt;Esc&gt;u9@.       : similar to the one above but goes to
current register
</li>
<li>V"=[&lt;C-R&gt;&lt;C-A&gt;]&lt;CR&gt;p   : V : visual line
"= expression register
[ ] list
&lt;C-R&gt; cursor moves to the command-line
&lt;C-A&gt; this normally adds to the number at
the cursor, not sure what this C-A does
p : put command
&lt;C-R&gt;&lt;C-A&gt; seems to get the word at
the cursor of the selected text
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Comments in vimgolf:</h3>
<div class="outline-text-3" id="text-1-7">
<p>
jdupont655: @chunleng: &lt;C-R&gt;&lt;C-A&gt; is one of several ways to
automatically insert some text on the command line, when this text is
already under the cursor in the buffer.
</p>

<p>
Depending on type of text, you can hit different mappings:
</p>

<ul class="org-ul">
<li>&lt;C-R&gt;&lt;C-W&gt; for a word,
</li>
<li>&lt;C-R&gt;&lt;C-A&gt; for a WORD,
</li>
<li>&lt;C-R&gt;&lt;C-F&gt; for a filepath,
</li>
<li>&lt;C-R&gt;&lt;C-P&gt; for an expanded filepath.
</li>
</ul>
<p>
Here, when you hit &lt;C-R&gt;&lt;C-A&gt;, your cursor is on one of the digits, so
the WORD under the cursor is ——…2,…,29,. Besides, the number
of minus signs in front of the number 2 is even (24; 1 at the end of
the first line, then 23 on the second one). So, -—…2 evaluates to
the positive number 2. Finally, you replace the line by putting the
evaluation of an expression given through the expression register
("={expr}p). Here, the expression is a list ([2, …, 29]), and when
you ask to put a list, Vim puts each of its item on a separate line.
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">References:</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>"= : <a href="http://vimdoc.sourceforge.net/htmldoc/change.html#quote=">vimdoc</a>
</li>
<li>
<a href="https://stackoverflow.com/questions/1276403/simple-vim-commands-you-wish-youd-known-earlier">useful Potpourri</a>
</li>
<li>
<a href="https://stackoverflow.com/questions/1497958/how-do-i-use-vim-registers">Registers</a>
</li>
<li>
<a href="https://books.google.com/books?id=wx5O0JLesi0C&amp;pg=PT183&amp;lpg=PT183&amp;dq=vim+the+equal+register&amp;source=bl&amp;ots=vWwaLy30rd&amp;sig=3fOvxidlUFgcby7_9WGxkCE9MY8&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwiW2qDEkeLYAhVC-mMKHfflA944ChDoAQgnMAA#v=onepage&amp;q=vim%20the%20equal%20register&amp;f=false">Expression register</a>
</li>
<li>
<a href="http://vimdoc.sourceforge.net/htmldoc/insert.html#i_CTRL-R">:h i<sub>Ctrl</sub>-R</a>
</li>
</ul>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/vim/" rel="tag">vim</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="next">
                <a href="../git-head-and-branches/" rel="next" title="git head and branches">Next post</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>Comments</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="frankliu",
            disqus_url="http://www.frankliu.org/posts/vimgolf-one-number-per-line/",
        disqus_title="vimgolf: One number per line",
        disqus_identifier="cache/posts/vimgolf-one-number-per-line.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="frankliu";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:frankie.y.liu@gmail.com">Frankie Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
